#!/usr/bin/python
# -*- coding: utf-8 -*-
__author__ = 'Ruslan Talipov'


l7 = [
    [u"гол", u"головку", u"головка", u"головки",]
]

l6 = [
    [ u"бутончик", u"бутончика", u"бутончиков" ],#или
    [ u"зубчик", u"зубчика", u"зубчиков" ], #или
    [ u"полосок", u"полоска"], #или
    [ u"стеблей", u"стебель" ], #или
    [ u"щепотка", u"щепотки", u"щетопок"]
]

l5 = [
    [u"лист", u"листьев", u"листов", u"листа"], # или
    [u"веточек", u"веточка", u"веточки", u"палочек", u"палочка", u"палочки", u"стручек", u"стручка", u"стручки"],
]

l1 = [
    [u'ст', u'ст.', u'стол', u'стол.', u'столовые', u'столовых', u'столовой'], # или
    [u'ч', u'ч.', u'чайные', u'чайных', u'чайной'],

    [u'л', u'ложек', u"ложки", u"ложа"]
]

l2 = [
    [ u"шт", u"штук", u"штуки" ], # или
    [ u"горсть", u"горстей" ], # или
    [ u"к", u"кило", u"кг", u"килог", u"г", u"гр", u"килогр", u"кграмма" u"грамма", u"килограмма"], # или
    [ u"м", u"милли", u"мл", u"миллил", u"миллилитра", u"литра", u"млитра" ]
]

l3 = [
    [ u"уп", u"упаковки", u"упаковка", u"упаковок" ], # или
    [ u"п", u"пакетик", u"пакетиков", u"пакетика"],# или
    [ u"чашка", u"чашки"]
]

l4 = [
    [u"стакан", u"стакана", u"стаканов"], # или
    [u"банка", u"банки"], # или
    [u"половины",u"половина",u"половини", u"половинкы", u"половинка", u"половинки"]
]

test = []
for data in [l1, l2, l3, l4, l5, l6, l7]:
    for item in data:
        for i in item:
            test.append(i)
